---
type: LightFamily
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 11
tags: [revit-api, class]
---

# LightFamily

`Autodesk.Revit.DB.Lighting.LightFamily` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetLightDistributionStyle | 2013 | `public LightDistributionStyle GetLightDistributionStyle ()` |
| Method | GetLightFamily | 2013 | `public static LightFamily GetLightFamily ( Document document )` |
| Method | GetLightShapeStyle | 2013 | `public LightShapeStyle GetLightShapeStyle ()` |
| Method | GetLightSourceTransform | 2013 | `public Transform GetLightSourceTransform ()` |
| Method | GetLightType | 2013 | `public LightType GetLightType ( int index )` |
| Method | GetLightTypeName | 2013 | `public string GetLightTypeName ( int index )` |
| Method | GetNumberOfLightTypes | 2013 | `public int GetNumberOfLightTypes ()` |
| Method | SetLightDistributionStyle | 2013 | `public void SetLightDistributionStyle ( LightDistributionStyle lightDistributionStyle )` |
| Method | SetLightShapeStyle | 2013 | `public void SetLightShapeStyle ( LightShapeStyle lightShapeStyle )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |